mcSimoffa/nRF51_BLE_nucleometer/Application/main.c
// YOUR_JOB: Use UUIDs for service(s) used in your application.
static ble_uuid_t m_adv_uuids[] = { {BLE_UUID_DEVICE_INFORMATION_SERVICE, BLE_UUID_TYPE_BLE} }; //service identifiers.

APP_TIMER_DEF(m_sec_req_timer_id);        // timer for secure connection
APP_TIMER_DEF(m_analogPart_timer_id);     // timer for Analog part

pm_peer_id_t m_peer_to_be_deleted = PM_PEER_ID_INVALID;

//_____________________________________________________________________________________
/**@brief Function for putting the chip into sleep mode.
 *
 * @note This function will not return.
 ************************************************************************ */
static void sleep_mode_enter(void) 
{
  NRF_LOG_INFO("Sleep mode enter\r\n");
  uint32_t err_code = bsp_indication_set(BSP_INDICATE_IDLE);
  APP_ERROR_CHECK(err_code);
  // Prepare wakeup buttons. Booth buttons can wakeUp device
  err_code = bsp_btn_ble_sleep_mode_prepare();
  APP_ERROR_CHECK(err_code);
  return;                                                         //This added I by comfort debug
  // Go to system-off mode 
  // (this function will not return; wakeup will cause a reset).
  err_code = sd_power_system_off();
  APP_ERROR_CHECK(err_code);
}

/**@brief Callback function for asserts in the SoftDevice.
 * @details This function will be called in case of an assert in the
 * SoftDevice.
 * @warning This handler is an example only and does not fit a final product.
 * You need to analyze how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on
 * reset.
 *
 * @param[in] line_num   Line number of the failing ASSERT call.
 * @param[in] file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t *p_file_name) 
{
  app_error_handler(DEAD_BEEF, line_num, p_file_name);
}

/**@brief Function for handling Peer Manager events.
 * @param[in] p_evt  Peer Manager event.
 ************************************************************** */
static void pm_evt_handler(pm_evt_t const *p_evt) 
{
  ret_code_t err_code;

  switch (p_evt->evt_id) 
  {
    case PM_EVT_BONDED_PEER_CONNECTED: 
    {
      NRF_LOG_INFO("Connected to a previously bonded device.\r\n");
      // Start Security Request timer.
      err_code = app_timer_start(m_sec_req_timer_id, SECURITY_REQUEST_DELAY, NULL);
      APP_ERROR_CHECK(err_code);
    } break;

    case PM_EVT_CONN_SEC_SUCCEEDED: 
    {
      pm_conn_sec_status_t conn_sec_status;

      // Check if the link is authenticated (meaning at least MITM).
      err_code = pm_conn_sec_status_get(p_evt->conn_handle, &conn_sec_status);
      APP_ERROR_CHECK(err_code);

      if (conn_sec_status.mitm_protected)
      {
        NRF_LOG_INFO("Link secured. Role: %d. conn_handle: %d, Procedure: %d\r\n",
                     ble_conn_state_role(p_evt->conn_handle),
                     p_evt->conn_handle,
                     p_evt->params.conn_sec_succeeded.procedure);
      }
      else
      {
        // The peer did not use MITM, disconnect.
        NRF_LOG_INFO("Collector did not use MITM, disconnecting\r\n");
        err_code = pm_peer_id_get(m_conn_handle, &m_peer_to_be_deleted);
        APP_ERROR_CHECK(err_code);
        err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
        APP_ERROR_CHECK(err_code);
      }
    } break;

    case PM_EVT_CONN_SEC_FAILED: 
    {
      NRF_LOG_INFO("Failed to secure connection. Disconnecting.\r\n");
      m_conn_handle = BLE_CONN_HANDLE_INVALID;
      err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
      //APP_ERROR_CHECK(err_code);
    } break;

    case PM_EVT_CONN_SEC_CONFIG_REQ: 
    {
      // Reject pairing request from an already bonded peer.
      pm_conn_sec_config_t conn_sec_config = {.allow_repairing = false};
      pm_conn_sec_config_reply(p_evt->conn_handle, &conn_sec_config);
    } break;

    case PM_EVT_STORAGE_FULL:
    {
      // Run garbage collection on the flash.
      NRF_LOG_INFO("Garbage collect\r\n");
      err_code = fds_gc();
      if (err_code == FDS_ERR_BUSY || err_code == FDS_ERR_NO_SPACE_IN_QUEUES) 
      {
        // Retry.
      } else 
        APP_ERROR_CHECK(err_code);
    } break;

    case PM_EVT_PEERS_DELETE_SUCCEEDED: 
      NRF_LOG_INFO("Peer deleted\r\n");
      ble_advertising_start(BLE_ADV_MODE_FAST);
      break;

    case PM_EVT_LOCAL_DB_CACHE_APPLY_FAILED: 
      // The local database has likely changed, send service changed indications.
      NRF_LOG_INFO("Local DB changed\r\n");
      pm_local_database_has_changed();
      break;

    case PM_EVT_PEER_DATA_UPDATE_FAILED:
      // Assert.
      APP_ERROR_CHECK(p_evt->params.peer_data_update_failed.error);
      break;

    case PM_EVT_PEER_DELETE_FAILED:
      // Assert.
      APP_ERROR_CHECK(p_evt->params.peer_delete_failed.error);
      break;

    case PM_EVT_PEERS_DELETE_FAILED:
      // Assert.
      APP_ERROR_CHECK(p_evt->params.peers_delete_failed_evt.error);
      break;

    case PM_EVT_ERROR_UNEXPECTED: 
      // Assert.
      APP_ERROR_CHECK(p_evt->params.error_unexpected.error);
      break;

    case PM_EVT_CONN_SEC_START:
      NRF_LOG_INFO("SEC connect start\r\n");
      break;
    case PM_EVT_PEER_DATA_UPDATE_SUCCEEDED:
      NRF_LOG_INFO("Peer data update succeeded\r\n");
      break;
    case PM_EVT_PEER_DELETE_SUCCEEDED:
      NRF_LOG_INFO("Peer data delete succeeded\r\n");
      break;
    case PM_EVT_LOCAL_DB_CACHE_APPLIED:
      NRF_LOG_INFO("Local DB cache applied\r\n");
      break;
    case PM_EVT_SERVICE_CHANGED_IND_SENT:
      NRF_LOG_INFO("Service changed ind sent\r\n");
      break;
    case PM_EVT_SERVICE_CHANGED_IND_CONFIRMED:
      NRF_LOG_INFO("Service changed ind confirmed\r\n");
      break;
    default:
      break;
    }
}

/**@brief Function for performing a battery measurement, and update the Battery Level characteristic in the Battery Service.
 */
static void battery_level_update(void)
{
  uint32_t err_code;
  static uint8_t  battery_level=100;

  //battery_level = 90; // in %
  if (--battery_level <10)
    battery_level=100;

  err_code = ble_bas_battery_level_update(&m_bas, battery_level);
  if ((err_code != NRF_SUCCESS) &&
      (err_code != NRF_ERROR_INVALID_STATE) &&
      (err_code != BLE_ERROR_NO_TX_PACKETS) &&
      (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING) )
  {
    APP_ERROR_HANDLER(err_code);
  }

