mcSimoffa/nRF51_BLE_nucleometer/Application/main.c
  //notification IO service. This is here for example. Refresh by timer
  err_code = ble_ios_on_output_change(&m_ios, &battery_level, OUTPUT_CHAR_LEN);
    if (err_code != NRF_SUCCESS &&
        err_code != BLE_ERROR_INVALID_CONN_HANDLE &&
        err_code != NRF_ERROR_INVALID_STATE)
    {
      APP_ERROR_CHECK(err_code);
    }

}



/**@brief Function for handling the Security Request timer timeout.
 *
 * @details This function will be called each time the Security Request timer expires.
 *
 * @param[in] p_context  Pointer used for passing some arbitrary information (context) from the
 *                       app_start_timer() call to the timeout handler.
 ******************************************************************************************  */
static void sec_req_timeout_handler(void * p_context)
{
    uint32_t err_code;

    if (m_conn_handle != BLE_CONN_HANDLE_INVALID)
    {
        // Initiate bonding.
        NRF_LOG_DEBUG("Sec timer expired. Start encryption\r\n");
        err_code = pm_conn_secure(m_conn_handle, false);
        if (err_code != NRF_ERROR_INVALID_STATE)
        {
            APP_ERROR_CHECK(err_code);
        }
    }
}

/**@brief Function for handling the Connection Parameters Module.
 *
 * @details This function will be called for all events in the Connection
 * Parameters Module which are passed to the application.
 *          @note All this function does is to disconnect. This could have been
 * done by simply setting the disconnect_on_fail config parameter, but instead
 * we use the event handler mechanism to demonstrate its use.
 *
 * @param[in] p_evt  Event received from the Connection Parameters Module.
 **************************************************************************  */
static void on_conn_params_evt(ble_conn_params_evt_t *p_evt) 
{
  uint32_t err_code;

  if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED) 
  {
    NRF_LOG_INFO("BLE_CONN_PARAMS_EVT_FAILED\r\n");
    err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
    APP_ERROR_CHECK(err_code);
  }
}

/**@brief Function for handling a Connection Parameters error.
 *
 * @param[in] nrf_error  Error code containing information about what went
 * wrong.
 ************************************************************************* */
static void conn_params_error_handler(uint32_t nrf_error) 
{
  APP_ERROR_HANDLER(nrf_error);
}

/**@brief Function for handling advertising events.
 *
 * @details This function will be called for advertising events which are
 * passed to the application.
 *
 * @param[in] ble_adv_evt  Advertising event.
 ************************************************************************** */
static void on_adv_evt(ble_adv_evt_t ble_adv_evt) 
{
  uint32_t err_code;

  switch (ble_adv_evt) 
  {
  case BLE_ADV_EVT_FAST:
    NRF_LOG_INFO("Fast advertising\r\n");
    err_code = bsp_indication_set(BSP_INDICATE_ADVERTISING);
    APP_ERROR_CHECK(err_code);
    break;

  case BLE_ADV_EVT_IDLE:
    NRF_LOG_INFO("BLE advertising Idle\r\n");
    sleep_mode_enter();
    break;

  default:
    break;
  }
}

/**@brief Function for handling the Application's BLE Stack events.
 *
 * @param[in] p_ble_evt  Bluetooth stack event.
 ********************************************************************** */
static void on_ble_evt(ble_evt_t *p_ble_evt) 
{
  uint32_t err_code = NRF_SUCCESS;

  switch (p_ble_evt->header.evt_id) 
  {
  case BLE_GAP_EVT_DISCONNECTED:
    {
      NRF_LOG_INFO("Disconnected\r\n");
      m_conn_handle = BLE_CONN_HANDLE_INVALID;

      // check if the last connected peer had not used MITM, if so, delete its bond information
      if (m_peer_to_be_deleted != PM_PEER_ID_INVALID)
      {
          ret_code_t ret_val = pm_peer_delete(m_peer_to_be_deleted);
          APP_ERROR_CHECK(ret_val);
          NRF_LOG_DEBUG("Collector's bond deleted\r\n");
          m_peer_to_be_deleted = PM_PEER_ID_INVALID;
      }
    } break; // BLE_GAP_EVT_DISCONNECTED

  case BLE_GAP_EVT_CONNECTED:
  {
    char peeraddr[7];
    memcpy(peeraddr, p_ble_evt->evt.gap_evt.params.connected.peer_addr.addr, 6);
    peeraddr[6] = 0;
    NRF_LOG_INFO("Connected. peer addr:");
    nrf_log_frontend_hexdump(NRF_LOG_LEVEL_INFO,"",peeraddr,6);
    NRF_LOG_INFO("peer addr type: %d\r\n", p_ble_evt->evt.gap_evt.params.connected.peer_addr.addr_type);
    m_peer_to_be_deleted = PM_PEER_ID_INVALID;
    err_code = bsp_indication_set(BSP_INDICATE_CONNECTED);
    APP_ERROR_CHECK(err_code);
    m_conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
    // Start Security Request timer.
    err_code = app_timer_start(m_sec_req_timer_id, SECURITY_REQUEST_DELAY, NULL);
    APP_ERROR_CHECK(err_code);
    NRF_LOG_INFO("Security timer start\r\n");
  } break; // BLE_GAP_EVT_CONNECTED

  case BLE_GATTC_EVT_TIMEOUT:
    // Disconnect on GATT Client timeout event.
    NRF_LOG_DEBUG("GATT Client Timeout.\r\n");
    err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gattc_evt.conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
    APP_ERROR_CHECK(err_code);
    break; // BLE_GATTC_EVT_TIMEOUT

  case BLE_GATTS_EVT_TIMEOUT:
    // Disconnect on GATT Server timeout event.
    NRF_LOG_DEBUG("GATT Server Timeout.\r\n");
    err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gatts_evt.conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
    APP_ERROR_CHECK(err_code);
    break; // BLE_GATTS_EVT_TIMEOUT

  case BLE_GAP_EVT_SEC_PARAMS_REQUEST:
    NRF_LOG_DEBUG("BLE_GAP_EVT_SEC_PARAMS_REQUEST\r\n");
    break; // BLE_GAP_EVT_SEC_PARAMS_REQUEST

case BLE_GAP_EVT_PASSKEY_DISPLAY:
  {
    char passkey[STATIC_PASSKEY_LEN+1];
    memcpy(passkey, p_ble_evt->evt.gap_evt.params.passkey_display.passkey, STATIC_PASSKEY_LEN);
    passkey[STATIC_PASSKEY_LEN] = 0;

    // Don't send delayed Security Request if security procedure is already in progress.
     err_code = app_timer_stop(m_sec_req_timer_id);
     NRF_LOG_INFO("Security timer stop\r\n");
     APP_ERROR_CHECK(err_code);

    NRF_LOG_INFO("Passkey: %s\r\n", nrf_log_push(passkey));
  } break; // BLE_GAP_EVT_PASSKEY_DISPLAY

  case BLE_EVT_USER_MEM_REQUEST:
    err_code = sd_ble_user_mem_reply(m_conn_handle, NULL);
    APP_ERROR_CHECK(err_code);
    break; // BLE_EVT_USER_MEM_REQUEST

  case BLE_GATTS_EVT_RW_AUTHORIZE_REQUEST: 
  {
    ble_gatts_evt_rw_authorize_request_t req;
    ble_gatts_rw_authorize_reply_params_t auth_reply;

    req = p_ble_evt->evt.gatts_evt.params.authorize_request;
    if (req.type != BLE_GATTS_AUTHORIZE_TYPE_INVALID) 
    {
      if ((req.request.write.op == BLE_GATTS_OP_PREP_WRITE_REQ) ||
          (req.request.write.op == BLE_GATTS_OP_EXEC_WRITE_REQ_NOW) ||
          (req.request.write.op == BLE_GATTS_OP_EXEC_WRITE_REQ_CANCEL)) 
      {
        if (req.type == BLE_GATTS_AUTHORIZE_TYPE_WRITE) 
        {
          auth_reply.type = BLE_GATTS_AUTHORIZE_TYPE_WRITE;
        } 
        else 
        {
          auth_reply.type = BLE_GATTS_AUTHORIZE_TYPE_READ;
        }
        auth_reply.params.write.gatt_status = APP_FEATURE_NOT_SUPPORTED;
        err_code = sd_ble_gatts_rw_authorize_reply(p_ble_evt->evt.gatts_evt.conn_handle, &auth_reply);
        APP_ERROR_CHECK(err_code);
      }
    }
  } break; // BLE_GATTS_EVT_RW_AUTHORIZE_REQUEST

#if (NRF_SD_BLE_API_VERSION == 3)
  case BLE_GATTS_EVT_EXCHANGE_MTU_REQUEST:
    err_code = sd_ble_gatts_exchange_mtu_reply(p_ble_evt->evt.gatts_evt.conn_handle, NRF_BLE_MAX_MTU_SIZE);
    APP_ERROR_CHECK(err_code);
    break; // BLE_GATTS_EVT_EXCHANGE_MTU_REQUEST
#endif

  default:
    // No implementation needed.
    break;
  }
}

/**@brief Function for handling events from the BSP module.
 *
 * @param[in]   event   Event generated when button is pressed.
 ******************************************************************* */
static void bsp_event_handler(bsp_event_t event) 
{
  uint32_t err_code;

