mcSimoffa/nRF51_BLE_nucleometer/Application/main.c
  *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}

/**@brief Function for the Power manager.
 ******************************************  */
static void power_manage(void) 
{
  uint32_t err_code = sd_app_evt_wait();
  APP_ERROR_CHECK(err_code);
}

/*
Define static passkey  
******************************************* */
void static_passkey_def(void) 
{
  static uint8_t static_passkey[] = "654321";
  ret_code_t err_code;
  ble_opt_t opt;

  memset(&opt, 0x00, sizeof(opt));
  opt.gap_opt.passkey.p_passkey = static_passkey;
  err_code = sd_ble_opt_set(BLE_GAP_OPT_PASSKEY, &opt);
  APP_ERROR_CHECK(err_code);
}

/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module. This creates and starts application
 * timers.
 *************************************************************************** */
static void timers_init(void) 
{
  uint32_t err_code;
  // Initialize timer module.
  APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, false);

  /* Create timers. YOUR_JOB: Create any timers to be used by the application.
  Below is an example of how to create a timer  For every new timer needed, increase the value of the macro  APP_TIMER_MAX_TIMERS by one. */

  // Create Security Request timer.
  err_code = app_timer_create(&m_sec_req_timer_id,  APP_TIMER_MODE_SINGLE_SHOT, sec_req_timeout_handler);
  APP_ERROR_CHECK(err_code);

  // Create timers for Analog circuits (HV convertor + battery service).
  err_code = app_timer_create(&m_analogPart_timer_id,  APP_TIMER_MODE_REPEATED,  analogPart_timeout_handler);
  APP_ERROR_CHECK(err_code);
}

/**@brief Function for the GAP initialization.
 *
 * @details This function sets up all the necessary GAP (Generic Access
 * Profile) parameters of the device including the device name, appearance, and
 * the preferred connection parameters.
 ***************************************************************************** */
static void gap_params_init(void) 
{
  uint32_t err_code;
  ble_gap_conn_params_t gap_conn_params;
  ble_gap_conn_sec_mode_t sec_mode;

  BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

  err_code = sd_ble_gap_device_name_set(&sec_mode, (const uint8_t *)DEVICE_NAME, strlen(DEVICE_NAME));
  APP_ERROR_CHECK(err_code);

  err_code = sd_ble_gap_appearance_set(BLE_APPEARANCE);
  APP_ERROR_CHECK(err_code);

  memset(&gap_conn_params, 0, sizeof(gap_conn_params));

  gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
  gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
  gap_conn_params.slave_latency = SLAVE_LATENCY;
  gap_conn_params.conn_sup_timeout = CONN_SUP_TIMEOUT;

  err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
  APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling the YYY Service events.
 * YOUR_JOB implement a service handler function depending on the event the
 service you are using can generate
 *
 * @details This function will be called for all YY Service events which are
 passed to
 *          the application.
 *
 * @param[in]   p_yy_service   YY Service structure.
 * @param[in]   p_evt          Event received from the YY Service.
 *
 *
   static void on_yys_evt(ble_yy_service_t     * p_yy_service,
                       ble_yy_service_evt_t * p_evt)
   {
    switch (p_evt->evt_type)
    {
        case BLE_YY_NAME_EVT_WRITE:
            APPL_LOG("[APPL]: charact written with value %s. \r\n",
 p_evt->params.char_xx.value.p_str); break;

        default:
            // No implementation needed.
            break;
    }
   }*/


/* *****************************************************************
This callback indicate a event write to Client Charackteristic Configuration
****************************************************************** */
void bas_handler (ble_bas_t * p_bas, ble_bas_evt_t * p_evt)
{
  NRF_LOG_INFO("Battery notificationt %d\r\n", p_evt->evt_type);  // 0 - Enable 1 - Disable
}


/**@brief Function for handling write events to the IO characteristic.
 *
 * @param[in] p_ios     Instance of IO Service to which the write applies.
 * @param[in] p_val     pointer to incoming value
 */
static void ios_input_event_handler(ble_ios_t * p_ios, uint16_t * p_val)
{
  //  The size of *p_val must be associated with INPUT_CHAR_LEN
  NRF_LOG_INFO("Input incoming 0x%X\r\n", *((uint16_t *) p_val));
}

/**@brief Function for initializing services that will be used by the
 * application.
 */
static void services_init(void) 
{
  uint32_t err_code;
  ble_dis_init_t    dis_init;
  ble_bas_init_t    bas_init;
  //ble_lbs_init_t    lbs_init;
  ble_dis_sys_id_t  sys_id;

  // Initialize Device Information Service.
  memset(&dis_init, 0, sizeof(dis_init));

  ble_srv_ascii_to_utf8(&dis_init.manufact_name_str, MANUFACTURER_NAME);
  ble_srv_ascii_to_utf8(&dis_init.model_num_str, MODEL_NUM);

  sys_id.manufacturer_id = MANUFACTURER_ID;
  sys_id.organizationally_unique_id = ORG_UNIQUE_ID;
  dis_init.p_sys_id = &sys_id;

  BLE_GAP_CONN_SEC_MODE_SET_OPEN(&dis_init.dis_attr_md.read_perm);
  BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(&dis_init.dis_attr_md.write_perm);

  err_code = ble_dis_init(&dis_init);
  APP_ERROR_CHECK(err_code);

  // Initialize Battery Service.
  memset(&bas_init, 0, sizeof(bas_init));

  // Here the sec level for the Battery Service can be changed/increased.
  BLE_GAP_CONN_SEC_MODE_SET_OPEN      (&bas_init.battery_level_char_attr_md.cccd_write_perm);
  BLE_GAP_CONN_SEC_MODE_SET_OPEN      (&bas_init.battery_level_char_attr_md.read_perm);
  BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS (&bas_init.battery_level_char_attr_md.write_perm);

  BLE_GAP_CONN_SEC_MODE_SET_OPEN      (&bas_init.battery_level_report_read_perm);

  bas_init.evt_handler          = bas_handler;//NULL;
  bas_init.support_notification = true;
  bas_init.p_report_ref         = NULL;
  bas_init.initial_batt_level   = 100;

  err_code = ble_bas_init(&m_bas, &bas_init);
  APP_ERROR_CHECK(err_code);

  // Input Outpur Service initialize
   err_code = ble_ios_init(&m_ios, ios_input_event_handler);
  APP_ERROR_CHECK(err_code);
}



/**@brief Function for initializing the Connection Parameters module.
******************************************************************** */
static void conn_params_init(void) 
{
  uint32_t err_code;
  ble_conn_params_init_t cp_init;

  memset(&cp_init, 0, sizeof(cp_init));
  cp_init.p_conn_params = NULL;
  cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
  cp_init.next_conn_params_update_delay = NEXT_CONN_PARAMS_UPDATE_DELAY;
  cp_init.max_conn_params_update_count = MAX_CONN_PARAMS_UPDATE_COUNT;
  cp_init.start_on_notify_cccd_handle = BLE_GATT_HANDLE_INVALID;
  cp_init.disconnect_on_fail = false;
  cp_init.evt_handler = on_conn_params_evt;
  cp_init.error_handler = conn_params_error_handler;

  err_code = ble_conn_params_init(&cp_init);
  APP_ERROR_CHECK(err_code);
}

/**@brief Function for starting application timers.
 */
static void application_timers_start(void)
{
    uint32_t err_code;

    // Start application timers.
    err_code = app_timer_start(m_analogPart_timer_id, ANALOGPART_TIMER_INTERVAL, NULL);
    APP_ERROR_CHECK(err_code);
}


/* *****************************************************************
                                                        main cycle
****************************************************************** */
int main(void) 
{
  uint32_t err_code;
  bool erase_bonds;

  // Initialize.
  err_code = NRF_LOG_INIT(NULL);
  APP_ERROR_CHECK(err_code);

  timers_init();
  buttons_leds_init(&erase_bonds);
  analog_part_init();
  ble_stack_init();
  peer_manager_init(erase_bonds);
  if (erase_bonds == true) 
  {
    NRF_LOG_INFO("Bonds erased!\r\n");
  }
  gap_params_init();
  services_init();
  advertising_init();
  conn_params_init();
  static_passkey_def();
  // Start execution.
  NRF_LOG_INFO("Template started\r\n");
  application_timers_start();
  err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
  APP_ERROR_CHECK(err_code);

  // Enter main loop.
  for (;;) {
    if (NRF_LOG_PROCESS() == false) 
    {
       power_manage();
    }
  }
}
